{
  "npcsData": {
    "act5": [
      {
        "image": "/images/knowledge/npcs/deckardcain.gif",
        "name": "데커드 케인",
        "desc": "당신에게 조언을 해줄 수있는 가장 신비로운 역사와 지식을 가진 호라드림 현자입니다.",
        "work": [
          "아이템 식별 - 케인은 인벤토리에있는 미확인 아이템을 모두 식별합니다."
        ],
        "voice": "cain"
      },
      {
        "image": "/images/knowledge/npcs/larzuk.gif",
        "name": "라주크",
        "desc": "라주크는 젊고 열정적인 선동가로 바알과의 전쟁이 끝날 때까지 그 길을 지키기로 결심했습니다. 그는 최고의 전투 장비를 만들 수 있는 능력에 자부심을 가지고 있으며 군대에 칼, 판금갑옷, 쇠사슬갑옷등을 공급하기 위해 끊임없이 노력합니다.",
        "work": [
          "수리 - 파손된 무기와 갑옷을 비용을 지불하면 수리해줍니다.",
          "거래 - 갑옷, 무기, 볼트 그리고 화살을 판매합니다."
        ],
        "voice": "larzuk"
      },
      {
        "image": "/images/knowledge/npcs/malah.gif",
        "name": "말라",
        "desc": "말라는 친절하고 선천적으로 낙관적인 여성임에도 불구하고, 악의 세력에 대항하는 많은 전투로 인해 지쳐있습니다. 그녀는 한평생 치유자로서의 경험을 이용하여, 부상당하거나 죽어가는 많은 사람들을 돕기 위해 최선을 다하고 있습니다. 그러나 그녀는 주변사람들이나 성역의 세계에 완전한 회복이 되지 않을거란 두려움 때문에 괴로워하고 있습니다.",
        "work": [
          "치유 - 말라는 당신의 생명력, 마나, 체력을 무료로 채워줄 것입니다.",
          "거래 - 갑옷, 지팡이, 마법봉, 셉터, 고서 치유물약, 물약, 열쇠, 스크롤을 판매합니다."
        ],
        "voice": "malah"
      },
      {
        "image": "/images/knowledge/npcs/nihlathak.gif",
        "name": "니라트하크",
        "desc": "마지막으로 살아남은 일족의 장로인 그는 그의 일족이 월드스톤을 지키지 못한것에 대한 고통으로 인해 미쳐가고 있었습니다. 장로들이 선택했던 수많은 대체 과정들을 끊임없이 되새기며, 그는 동료들과 함께 죽지 못했다는 죄책감을 안고 살아갑니다.",
        "work": [
          "도박 - 돈을 지불하면 나라트하크가 정체불명의 물건을 당신에게 팔 것입니다. 구입하면 해당 물건이 식별되고 어떤 물건을 받았는지 확인할 수 있습니다."
        ],
        "voice": "nihlathak"
      },
      {
        "image": "/images/knowledge/npcs/anya.gif",
        "name": "앤야",
        "desc": "바알에 의해 살해된 일족 장로의 딸인 앤야는 태어날 때부터 민족의 지도자가 되기 위해 키워져왔습니다. 그녀는 그녀의 일족의 역사, 마법 그리고 치유 기술에 대해 폭넓은 교육을 받았습니다. 그녀는 마음속으로 아버지의 죽음을 슬퍼하지만, 이런 어려운 시기에 남은 일족을 위해 강해져야 한다는 것을 알고 있습니다.",
        "work": [
          "거래 - 갑옷, 무기 (카타르등, 투척무기들), 열쇠와 화살을 판매합니다.",
          "도박 - 돈을 지불하면 앤야가 정체불명의 물건을 당신에게 팔 것입니다. 구입하면 해당 물건이 식별되고 어떤 물건을 받았는지 확인할 수 있습니다."
        ],
        "voice": "anya"
      },
      {
        "image": "/images/knowledge/npcs/qual-Kehk.gif",
        "name": "퀄 퀘크",
        "desc": "비록 지치고 공격받았지만, 암스 일족의 대장인 그의 부하들은 그를 의심의 여지없이 존경합니다. 그의 눈은 지평선 위에 암울하게 바라보고 있으며, 이길 수 없는 전투에서 자신과 부하들 모두 희생 될 것이라는 것을 인지한 채 비참한 모습을 하고 있습니다.",
        "work": [
          "고용 - 야만인을 고용 할 수 있습니다. "
        ],
        "voice": "qual-kehk"
      },
      {
        "image": "/images/knowledge/npcs/tyrael.gif",
        "name": "티리엘",
        "desc": "대천사 티리엘. 티리엘은 항상 우리를 보호해 왔지만, 지금은 우리를 도와줄 수 없습니다.",
        "work": [],
        "voice": "tyrael"
      }
    ]
  }
}