{
  "questsData": {
    "secret1": [
      {
        "label": "루머의 시작",
        "image": "/images/knowledge/quests/secret1/secret00.jpg",
        "desc": [
          "이때는 디아블로 1 시절이었는데, 본작의 배경인 트리스트람 마을 북동쪽에는 소 몇마리가 풀을 뜯고 있다. 클릭하면 소 울음 소리를 내는 것 외에는 아무 용도가 없는 놈들인데, 블리자드가 그 소들 앞에서 뭔가 행동을 취하면 '숨겨진 카우 레벨'로 가는 포탈이 열린다는 거짓 정보를 퍼뜨리기 시작한 것이다.",
          "나중에는 1999년 4월 1일 개발중인 디아블로2의 스샷이라면서 두발로 걷는 소떼가 도끼를 들고 사방에서 달려오는 스크린샷을 공개하기도 했다. 당연히 이때까지만 해도 유저들은 '블리자드가 만우절 낚시는 오지게 잘하는구나' 하고 웃어넘겼지만…"
        ]
      },
      {
        "label": "카우 레벨 오픈 방법",
        "image": "/images/knowledge/quests/secret1/secret01.jpg",
        "desc": [
          "디아블로2에서 실제로 등장하여 유저들을 충격과 공포로 몰아넣었다. 오픈 방법은 우선 디아블로 2를 한번 클리어 해야한다.",
          "오리지날은 디아블로, 확장팩은 바알을 잡아서 해당 난이도를 한번 클리어 해야한다. 다른 사람이 연 카우 레벨에 입장하는 것은 상관 없다.",
          "액트2에서 얻는 아이템 조합기인 '호라드릭 큐브'에 액트1의 파괴된 트리스트람 마을에서 얻는 워트의 의족과 상점에서 파는 타운포탈 책을 넣는다.",
          "이때 책에 든 포탈 스크롤의 숫자가 카우 몹의 수, 경험치, 아이템 등과 비례한다는 속설이 있어 꽉 채워 넣은 뒤에 카우 레벨을 열기도 한다. 하지만 0/20이건 20/20이건 아무 상관 없다."
        ]
      },
      {
        "label": "카우 레벨 입장",
        "image": "/images/knowledge/quests/secret1/secret02.jpg",
        "desc": [
          "이렇게 해서 준비물을 모은 다음 액트1의 마을인 로그 캠프 안에서 합치면 빨간 포탈이 열리고, 카우 레벨로 통하게 된다. 다만 로그 캠프에서만 가능하고 다른 마을에서는 불가능하다. 또한 난이도도 반영되는데 사례로 나메로 카우 레벨을 공략하고 싶을 땐 반드시 나메로 한 번 클리어하고 의족을 얻어 만들어야 하며, 만일 노말에서 얻은 의족으로 나메에서는 열기 불가능하니 주의."
        ]
      },
      {
        "label": "카우 레벨에 관하여",
        "image": "/images/knowledge/quests/secret1/secret03.jpg",
        "desc": [
          "카우 레벨의 지형은 스토니 필드를 모티브로 해서 만들어졌지만 스토니 필드와 달리 로그 캠프의 울타리가 있고, 불에 타버린 집과 성소와 우물이 없다는 차이만 있다."
        ]
      },
      {
        "label": "카우 레벨에 관하여",
        "image": "/images/knowledge/quests/secret1/secret04.jpg",
        "desc": [
          "카우 레벨은 말 그대로 할버드를 든 지옥소(Hell Bovine) 떼들이 인해전술처럼 마구 몰려와서 플레이어를 죽이려고 하는 것이다. 이 소들이 다가올 때 내는 소리는 'moo moo'이며 한국식으로 말하자면 '음메 음메'와 같다. 진짜 소의 울음소리가 아니라 사람 목소리로 무미건조하게 '음메음메' 하면서 달려오는 것이다. 덤으로 디아블로의 성우인 빌 로퍼가 지옥소들을 더빙했다고 한다."
        ]
      },
      {
        "label": "카우 레벨에 관하여",
        "image": "/images/knowledge/quests/secret1/secret05.jpg",
        "desc": [
          "확장팩 등장전에는 그야말로 들어가자마자 순식간에 썰려나갈 정도로 흉악하게 어려운 곳이었으나 확장팩이 등장하면서 강력한 장비들이 추가됨에 따라 형세가 역전, 이 소들이 경험치도 잘 주고 숫자도 상당히 많기 때문에 레벨업용 코스로 인기를 얻게 된다. 저레벨 캐릭터를 카우 레벨에 넣어두고 고렙 캐릭터가 소들을 열심히 잡게 하면 순식간에 90 이상의 레벨도 찍을수 있었다."
        ]
      }
    ]
  }
}