{
  "questsData": {
    "secret1": [
      {
        "label": "The beginning of a rumor",
        "image": "/images/knowledge/quests/secret1/secret00.jpg",
        "desc": [
          "Many players of the original Diablo will remember the mysterious rumor that there was a Secret Cow Level. The story went that by clicking on a specific cow in Tristram a certain number of times, you could access a wondrous place known as the Secret Cow Level. There was, of course, no Cow Level in Diablo, but the legend was born. When StarCraft was released, it featured a cheat code, 'There is no cow level'. This was our way of officially confirming that there was, in fact, no Secret Cow Level.",
          "During the production of Diablo II, gamers often asked if there would be any cows to battle in the game. On April 1st, 1999, a Diablo II Screenshot of the Week featured cows fighting. People wondered if the screenshot was an April Fool's joke or if there really was a Secret Cow Level planned for Diablo II.When Diablo II was released, a quest item called The Horadric Cube allowed players to combine items to create new items.It wasn't long before players were experimenting with Cube combinations, hoping to find the keys to unlock new and powerful secrets. Eventually a recipe was discovered that revealed the most anticipated secret of them all -- the Secret Cow Level in Diablo II!"
        ]
      },
      {
        "label": "Traveling to the Secret Cow Level",
        "image": "/images/knowledge/quests/secret1/secret01.jpg",
        "desc": [
          "To be able to create the red cow portal leading to the Secret Cow Level your character must first complete the 'Eve of Destruction' quest (the final quest in Act V) on the same difficulty setting.",
          "Go to the Rogue Encampment in Act I. Place one Tome of Town Portal + Wirt's Leg into the Horadric Cube and hit the Transmute button. A Red Portal will now open to the Secret Cow Level. You must transmute this combination in the Rogue Encampment for the portal to open. If you hear a message, 'I can't do that' then you are doing something wrong. Make sure you have completed the last quest in Act V, that you have placed the correct items in the Horadric Cube, and that you are transmuting the items in the correct location."
        ]
      },
      {
        "label": "Enter the Secret Cow Level",
        "image": "/images/knowledge/quests/secret1/secret02.jpg",
        "desc": [
          "Once you have Wirt's Leg, return to the Rogue Encampment and put it and a Tome of Town Portal into your Horadric Cube.The Tome does not need to be filled to work, so if you do not want to use the Tome you have filled with 20 Town Portals, you can simply buy an almost empty one from Akara."
        ]
      },
      {
        "label": "About the Secret Cow Level",
        "image": "/images/knowledge/quests/secret1/secret03.jpg",
        "desc": [
          "The Secret Cow Level can be very easy or very hard depending on your class, and what skills you use. The first thing you will notice is there are a LOT of cows. Exploring is not a wise idea, as you will quickly have an unbelievable number of Cows on your trail. Try to avoid being surrounded by the Cows at all costs."
        ]
      },
      {
        "label": "About the Secret Cow Level",
        "image": "/images/knowledge/quests/secret1/secret04.jpg",
        "desc": [
          "Use area effect spells if possible, such as the Necromancer's Corpse Explosion. The Sorceress can employ Fire Wall, Chain Lightning, Frozen Orb or Blizzard to great effect. Barbarians can use Grim Wards, Howl and Whirlwind. Amazons can use Freezing Arrows, Decoy and Valkyrie to keep the Cows at bay. Paladins can use Conversion and their Thorns aura. Druids can use Fissure, Tornado, Hurricane and Armageddon. Assassins can use Wake of Inferno, Death Sentry, Claws of Thunder, Blades of Ice, Phoenix Strike and the Shadow Master."
        ]
      },
      {
        "label": "About the Secret Cow Level",
        "image": "/images/knowledge/quests/secret1/secret05.jpg",
        "desc": [
          "Try to stay in one area until you kill all of the cows in a pack. Try to not run around too much until you have cleared out the cows in your area or you run the risk of attracting too many cows."
        ]
      }
    ]
  }
}